# language: uk

@issue

Функціонал: Оформлення видачі примірника

Передумова:
Припустимо бібліотекар авторизований у системі
І читач зареєстрований в системі

Сценарій: Позитивне оформлення видачі
Припустимо існує читач зі статусом "active"
І читач не має прострочених видач
І читач не має іншого примірника цього ж видання
І у фонді є вільний примірник видання

Коли бібліотекар оформлює видачу цього примірника читачеві

Тоді система реєструє нову активну видачу
І дата початку видачі встановлюється як поточна дата
І термін повернення встановлюється через 30 днів від поточної дати
І поле дати повернення "closedDate" залишається порожнім

Структура сценарію: Відмова у видачі примірника через порушення правил

Припустимо читач має статус <статус_читача>
І читач <має_прострочення> прострочені видачі
І читач <має_примірник> примірник видання
І фонд <має_примірник_фонд> примірник видання без активної видачі

Коли бібліотекар оформлює видачу цього примірника читачеві
Тоді система відмовляє у реєстрації видачі
І відображає повідомлення <повідомлення>

Приклади:
| статус_читача | має_прострочення | має_примірник | має_примірник_фонд | повідомлення |
| blocked |"не має" | "не має" | "має" | "Читач заблокований через несплачені штрафи" |
| active | "має" | "не має" | "має" |"У читача є неповернуті прострочені книги" |
| active | "не має" | "має" | "має" |"У читача є примірник видання" |
| active | "не має" | "не має" | "не має" |"Бібліотека не має вільного примірника видання" |